{
    "translation": {
        "About": "Sobre",
        "Skills": "Habilidades",
        "Projects": "Projetos",
        "Contact": "Contato",

        "Hello":"Olá",
        "My name is Matheus": "Me chamo Matheus",
        "Front-end Developer": "Desenvolvedor Front-End",
        "Hire": "Contratar",
        "Get resume": "Obter Curriculo",

        "LET'S TALK ABOUT ME": "VAMOS FALAR SOBRE MIM",

        "As a front-end developer, my focus is creating digital experiences that go beyond basic functionality. I see myself as a digital architect, designing interfaces that not only work, but also engage and captivate users.": "Como desenvolvedor front-end, meu foco é criar experiências digitais que vão além da funcionalidade básica. Vejo-me como um arquiteto digital, projetando interfaces que não apenas funcionam, mas também envolvem e cativam os usuários.",

        "It’s about giving shape to digital, creating a unique and immersive experience for users. We are the architects of the digital world, bringing every line of code and every pixel on the screen to life. Together, we build the future of the web, where creativity flourishes and digital life comes to life.": "É dar forma ao digital, criando uma experiência única e imersiva para os usuários. Somos os arquitetos do mundo digital, dando vida a cada linha de código e cada pixel na tela. Juntos, construímos o futuro da web, onde a criatividade floresce e a vida digital ganha vida.",

        "Download CV": "Obter CV",

        "As a developer, I have a wide range of technical skills and competencies that allow me to create innovative and efficient solutions.": "Como desenvolvedor, possuo uma ampla gama de habilidades técnicas e competências que me permitem criar soluções inovadoras e eficientes.",

        "Tools": "Ferramentas",
        "of technologies that I master":"de tecnologias que domino",
        "LIBRARIES": "BIBLIOTECAS",

        "Libraries that I have experience working with:": "Bibliotecas que tenho expêriencia em trabalhar:",
        "Knowledge of working with APIs in the REST standard.": "Conhecimentos em trabalhar com API's No padrão REST.",

        "ecosystem": "ecossistema",
        "DATABASES": "BANCO DE DADOS",
        "Knowledge to manage:": "Conhecimentos para administrar:",
        "Project Gallery": "Galeria de Projetos",

        "Welcome to my project gallery! Here, I share with you some of what I have created as a programmer.": "Bem-vindo à minha galeria de projetos! Aqui, compartilho com você um pouco do que tenho criado como programador.",

        "ALL": "TODOS",
        "RECENT": "RECENTES",
        "UNDER DEVELOPMENT": "EM DESENVOLVIMENTO",

        "The hotel booking app provides a simple and secure platform to find and book accommodation across multiple cities. With it, users can select their desired destination and stay dates, view a list of available hotels, and compare amenities and prices before making their choice.": "O aplicativo de reservas de hotel oferece uma plataforma simples e segura para encontrar e reservar acomodações em várias cidades. Com ele, os usuários podem selecionar o destino desejado e as datas da estadia, visualizar uma lista de hotéis disponíveis e comparar comodidades e preços antes de fazer sua escolha..",

        "Full stack blog that combines React.js on the frontend and Node.js with MySQL on the backend. In the user authentication part, I integrated the functionality using JSON Web Tokens (JWT), with the JWT tokens stored in cookies for efficient management of user sessions. Additionally, the application enables users to create and edit blog posts, with posts being saved directly to the database, ensuring effective persistence of information.": "Blog full stack que combina React.js no frontend e Node.js com MySQL no backend. Na parte de autenticação do usuario, integrei a funcionalidade utilizando JSON Web Tokens (JWT), com os tokens JWT armazenados em cookies para uma gestão eficiente das sessões dos usuários. Além disso, a aplicação capacita os usuários a criarem e editarem posts no blog, com as postagens sendo salvas diretamente no banco de dados, garantindo uma persistência eficaz das informações.",

        "Tronmart E-Commerce is an online shopping platform built with the React.js framework. Focused on practicality, it offers users a simple and direct shopping experience. They can browse different products and add them to their cart with ease, making the purchasing process intuitive and efficient.": "O Tronmart E-Commerce é uma plataforma de compras online construída com o framework React.js. Focado na praticidade, oferece aos usuários uma experiência de compra simples e direta. Eles podem navegar por diversos produtos e adicioná-los ao carrinho com facilidade, tornando o processo de compra intuitivo e eficiente.",

        "The hotel booking app admin panel gives you full control over the system. Administrators can manage users, add and edit hotel and room information, and track reservations made by users. This tool simplifies and speeds up application management, ensuring efficient and personalized operation.": "O painel de administração do aplicativo de reservas de hotel oferece controle total sobre o sistema. Os administradores podem gerenciar usuários, adicionar e editar informações de hotéis e quartos, além de acompanhar as reservas feitas pelos usuários. Essa ferramenta simplifica e agiliza a gestão do aplicativo, garantindo uma operação eficiente e personalizada.",

        "A quick and fun mini game to run in browsers. You will have to survive for 15 seconds eliminating all the flies that appear on the screen. Contains 3 difficulty levels.": "Um mini game rápido e divertido para rodar em browsers. Você tera que sobreviver por 15 segundos eliminando todas as moscas que aparecerem na tela. Contém 3 níveis de dificuldade.",

        "fly swatting game": "Jogo mata mosquito",
        "No Projects...": "Sem Projetos...",
        "Do you have any projects? send a message": "Você tem algum projeto ? Mande mensagem",

        "JobAI is an efficient job search platform. Users can create an account, log in and search for jobs by position and location. We offer an integrated resume generator. We are constantly improving to provide the best experience for our users.": "O JobAI é uma plataforma de busca de empregos eficiente. Os usuários podem criar uma conta, fazer login e pesquisar vagas por cargo e localidade. Oferecemos um gerador de currículo integrado. Estamos constantemente melhorando para proporcionar a melhor experiência aos nossos usuários.",

        "Get in touch and let me know how I can help. Fill out the form, and I will get in touch as soon as possible.": "Entre em contato e diga como posso ajudar. Preencha o formulario, e  entrarei em contato o mais breve possivel.",

        "Phone": "Telefone",
        "Name": "Nome",
        "Submit": "Enviar",
        " All rights reserved": "Todos os direitos reservados",
        "Write your email": "Digite seu email",
        "Write your phone": "Digite seu telefone",
        "Write your name": "Digite seu nome"
        
    }
}